<?php

/**
 * MVM_MALL 网上商店系统 语言包
 * ============================================================================
 * 版权所有 (C) 2007-2018 www.mvmmall.cn，并保留所有权利。
 * 网站地址: http://www.mvmmall.cn
 * ----------------------------------------------------------------------------
 * 这不是一个自由软件！您只能在不用于商业目的的前提下对程序代码进行修改和
 * 使用；不允许对程序代码以任何形式任何目的的再发布。
 * ============================================================================
 * $Author: www.mvmmall.cn $
 * $Date: 2008-03-01 $
 * $Id: lang_cn.php www.mvmmall.cn$
 * ---------------------------------------------
*/

$lang=array();
$lang['shop_level'] = array(0=>'普通商铺',1=>'扶植商铺',2=>'标准商铺',3=>'拓展商铺',4=>'旗舰商铺');

//页
$lang['genus_total'] = '此类共';
$lang['note'] = '记 录';
$lang['pag_total'] ='共';
$lang['pags'] ='页';
$lang['pag_loction'] ='当前第';
$lang['pag_home'] ='首页';
$lang['pag_end'] ='末页';
$lang['pag_return'] ='上一页';
$lang['pag_next'] ='下一页';
$lang['pag_go'] ='转至第';