<?php

/**
 * MVM_MALL 网上商店系统 更新缓存管理
 * ============================================================================
 * 版权所有 (C) 2007-2018 www.mvmmall.cn，并保留所有权利。
 * 网站地址: http://www.mvmmall.cn
 * ----------------------------------------------------------------------------
 * 这不是一个自由软件！您只能在不用于商业目的的前提下对程序代码进行修改和
 * 使用；不允许对程序代码以任何形式任何目的的再发布。
 * ============================================================================
 * $Author:  www.mvmmall.cn  $
 * $Date: 2008-10-03 $
 * $Id: cache.inc.php  www.mvmmall.cn$
 * ---------------------------------------------
*/

if(!defined('MVMMALL') || !defined('IN_ADMINCP')) exit('Access Denied');
if($action=='edit')
{
    //更新商铺私有缓存
    if($del_privete==1) $cache->flush(false);
    else $cache->flush(true);
    
    admin_log("清空缓存");
    show_msg('success');
}