/* $Id : initcity.js www.mvmmall.cn $ */
function initcity(slcity) {
	province = document.creator ? document.creator["province"].value : document.getElementById('province').value;
        
    switch (province) {
        case "安徽省" :
            var cityOptions = new Array(
            "合肥市(*)", "合肥市",
            "安庆市", "安庆市",
            "蚌埠市", "蚌埠市",
            "亳州市", "亳州市",
            "滁州市", "滁州市",
            "阜阳市", "阜阳市",
            "池州市", "池州市",
            "淮北市", "淮北市",
            "淮南市", "淮南市",
            "黄山市", "黄山市",
            "六安市", "六安市",
            "马鞍山市", "马鞍山市",
            "宿州市", "宿州市",
            "铜陵市", "铜陵市",
            "芜湖市", "芜湖市",
            "宣城市", "宣城市");
             break;
	    case "安徽省" :
            var cityOptions = new Array(
            "合肥市(*)", "合肥市",
            "安庆市", "安庆市",
            "蚌埠市", "蚌埠市",
            "亳州市", "亳州市",
            "滁州市", "滁州市",
            "阜阳市", "阜阳市",
            "池州市", "池州市",
            "淮北市", "淮北市",
            "淮南市", "淮南市",
            "黄山市", "黄山市",
            "六安市", "六安市",
            "马鞍山市", "马鞍山市",
            "宿州市", "宿州市",
            "铜陵市", "铜陵市",
            "芜湖市", "芜湖市",
            "宣城市", "宣城市");
             break;
	     case "北京市" :
            var cityOptions = new Array(
            "东城区", "东城区",
            "西城区", "西城区",
			"海淀区", "海淀区",
            "朝阳区", "朝阳区",
            "丰台区", "丰台区",
            "石景山区", "石景山区",
            "通州区", "通州区",
            "顺义区", "顺义区",
			"房山区", "房山区",
            "大兴区", "大兴区",
			"昌平区", "昌平区",
            "怀柔区", "怀柔区",
			"平谷区", "平谷区",
			"门头沟区", "门头沟区",
            "密云县", "密云县",
            "延庆县", "延庆县");
            break;
		case "重庆市" :
            var cityOptions = new Array(
            "渝中区", "渝中区",
            "大渡口区", "大渡口区",
            "江北区", "江北区",
            "沙坪坝区", "沙坪坝区",
            "九龙坡区", "九龙坡区",
            "南岸区", "南岸区",
            "北碚区","北碚区",
            "綦江区", "綦江区",
            "双桥区", "双桥区",
            "渝北区", "渝北区",
            "巴南区", "巴南区",
            "万州区", "万州区",
            "涪陵区", "涪陵区",
            "黔江区", "黔江区",
            "长寿区", "长寿区",
            "江津区", "江津区",
            "合川区", "合川区",
            "永川区", "永川区",
            "南川区", "南川区",
            "綦江县", "綦江县",
            "潼南县", "潼南县",
            "铜梁县", "铜梁县",
            "大足县", "大足县",
            "荣昌县", "荣昌县",
            "璧山县", "璧山县",
            "梁平县", "梁平县",
            "城口县", "城口县",
            "丰都县", "丰都县",
            "垫江县", "垫江县",
            "武隆县", "武隆县",
            "忠县", "忠县",
            "开县", "开县",
            "云阳县", "云阳县",
            "奉节县", "奉节县",
            "巫山县", "巫山县",
            "巫溪县", "巫溪县",
            "石柱土家族自治县", "石柱土家族自治县",
            "秀山土家族苗族自治县", "秀山土家族苗族自治县",
            "酉阳土家族苗族自治县", "酉阳土家族苗族自治县",
            "彭水苗族土家族自治县", "彭水苗族土家族自治县");
            break;
		case "福建省" :
            var cityOptions = new Array(
            "福州市(*)", "福州市",
            "厦门市", "厦门市",
			"泉州市", "泉州市",
			"莆田市", "莆田市",
			"三明市", "三明市",
			"漳州市", "漳州市",
			"南平市", "南平市",
            "龙岩市", "龙岩市",
            "宁德市", "宁德市");
			break;
		case "甘肃省" :
            var cityOptions = new Array(
            "兰州市(*)", "兰州市",
            "嘉峪关市", "嘉峪关市",
            "金昌市", "金昌市",
            "白银市", "白银市",
            "天水市", "天水市",
            "武威市", "武威市",
            "张掖市", "张掖市",
            "酒泉市", "酒泉市",
            "平凉市", "平凉市",
            "庆阳市", "庆阳市",
            "定西市", "定西市",
            "陇南市", "陇南市",
            "临夏回族自治州", "临夏回族自治州",
            "甘南藏族自治州", "甘南藏族自治州");
            break;
        case "广东省" :
            var cityOptions = new Array(
            "广州市(*)", "广州市",
            "深圳市", "深圳市",
            "珠海市", "珠海市",
            "汕头市", "汕头市",
            "佛山市", "佛山市",
            "韶关市", "韶关市",
            "湛江市", "湛江市",
            "肇庆市", "肇庆市",
            "江门市", "江门市",
            "茂名市", "茂名市",
            "惠州市", "惠州市",
            "梅州市", "梅州市",
            "汕尾市", "汕尾市",
            "河源市", "河源市",
            "阳江市", "阳江市",
            "清远市", "清远市",
            "东莞市", "东莞市",
            "中山市", "中山市",
            "潮州市", "潮州市",
            "揭阳市", "揭阳市",
            "云浮市", "云浮市");
            break;
        case "广西壮族自治区" :
            var cityOptions = new Array(
            "南宁市(*)", "南宁市",
            "柳州市", "柳州市",
            "桂林市", "桂林市",
            "梧州市", "梧州市",
            "北海市", "北海市",
            "防城港市", "防城港市",
            "钦州市", "钦州市",
            "贵港市", "贵港市",
            "玉林市", "玉林市",
            "百色市", "百色市",
			"贺州市", "贺州市",
			"河池市", "河池市",
			"来宾市", "来宾市",
            "崇左市", "崇左市");
            break;
		case "贵州省" :
            var cityOptions = new Array(
            "贵阳市(*)", "贵阳市",
            "六盘水市", "六盘水市",
            "遵义市", "遵义市",
            "安顺市", "安顺市",
            "毕节市", "毕节市",
            "铜仁市", "铜仁市",
            "黔南布依族苗族自治州", "黔南布依族苗族自治州",
            "黔西南布依族苗族自治州", "黔西南布依族苗族自治州",
            "黔东南苗族侗族自治州", "黔东南苗族侗族自治州");
            break;
        case "海南省" :
            var cityOptions = new Array(
            "海口市(*)", "海口市",
            "三亚市", "三亚市",
			"五指山市", "五指山市",
			"琼海市", "琼海市",
			"儋州市", "儋州市",
			"文昌市", "文昌市",
			"万宁市", "万宁市",
			"东方市", "东方市",
			"澄迈县", "澄迈县",
			"定安县", "定安县",
			"屯昌县", "屯昌县",
			"临高县", "临高县",
			"白沙黎族自治县", "白沙黎族自治县",
			"昌江黎族自治县", "昌江黎族自治县",
			"乐东黎族自治县", "乐东黎族自治县",
			"琼中黎族苗族自治县", "琼中黎族苗族自治县",
			"保亭黎族苗族自治县", "保亭黎族苗族自治县",
            "陵水黎族自治县", "陵水黎族自治县");
            break;
        case "河北省" :
            var cityOptions = new Array(
            "石家庄市(*)", "石家庄市",
            "保定市", "保定市",
            "邯郸市", "邯郸市",
            "秦皇岛市", "秦皇岛市",
            "张家口市", "张家口市",
            "唐山市", "唐山市",
            "承德市", "承德市",
            "廊坊市", "廊坊市",
            "沧州市", "沧州市",
            "衡水市", "衡水市",
            "邢台市", "邢台市");
            break;
		case "黑龙江省" :
            var cityOptions = new Array(
            "哈尔滨市(*)", "哈尔滨市",
            "齐齐哈尔市", "齐齐哈尔市",
            "牡丹江市", "牡丹江市",
            "佳木斯市", "佳木斯市",
            "大庆市", "大庆市",
            "鸡西市", "鸡西市",
            "双鸭山市", "双鸭山市",
            "伊春市", "伊春市",
            "七台河市", "七台河市",
            "鹤岗市", "鹤岗市",
            "黑河市", "黑河市",
            "绥化市", "绥化市",
            "大兴安岭地区", "大兴安岭地区");
            break;
        case "河南省" :
            var cityOptions = new Array(
            "郑州市(*)", "郑州市",
            "开封市", "开封市",
            "平顶山市", "平顶山市",
            "洛阳市", "洛阳市",
            "商丘市", "商丘市",
            "安阳市", "安阳市",
            "新乡市", "新乡市",
            "许昌市", "许昌市",
            "鹤壁市", "鹤壁市",
            "焦作市", "焦作市",
            "濮阳市", "濮阳市",
            "漯河市", "漯河市",
            "三门峡市", "三门峡市",
            "周口市", "周口市",
            "驻马店市", "驻马店市",
            "南阳市", "南阳市",
            "信阳市", "信阳市",
            "济源市", "济源市");
            break;
        case "湖北省" :
            var cityOptions = new Array(
            "武汉市(*)", "武汉市",
            "黄石市", "黄石市",
            "十堰市", "十堰市",
            "荆州市", "荆州市",
            "宜昌市", "宜昌市",
            "襄阳市", "襄阳市",
            "鄂州市", "鄂州市",
            "荆门市", "荆门市",
            "孝感市", "孝感市",
            "黄冈市", "黄冈市",
            "咸宁市", "咸宁市",
            "随州市", "随州市",
            "恩施土家族苗族自治州", "恩施土家族苗族自治州",
            "仙桃市", "仙桃市",
            "天门市", "天门市",
            "潜江市", "潜江市",
            "神农架林区", "神农架林区");
            break;
        case "湖南省" :
            var cityOptions = new Array(
            "长沙市(*)", "长沙市",
            "株洲市", "株洲市",
            "湘潭市", "湘潭市",
            "衡阳市", "衡阳市",
            "邵阳市", "邵阳市",
            "岳阳市", "岳阳市",
            "张家界市", "张家界市",
            "益阳市", "益阳市",
            "常德市", "常德市",
            "娄底市", "娄底市",
            "郴州市", "郴州市",
            "永州市", "永州市",
            "怀化市", "怀化市",
            "湘西土家族苗族自治州 ", "湘西土家族苗族自治州 ");
            break;
		case "江苏省" :
            var cityOptions = new Array(
            "南京市(*)", "南京市",
            "无锡市", "无锡市",
            "徐州市", "徐州市",
            "常州市", "常州市",
            "苏州市", "苏州市",
            "南通市", "南通市",
            "连云港市", "连云港市",
            "淮安市", "淮安市",
            "盐城市", "盐城市",
            "扬州市", "扬州市",
            "镇江市", "镇江市",
            "泰州市", "泰州市",
            "宿迁市", "宿迁市");
            break;
        case "江西省" :
            var cityOptions = new Array(
            "南昌市(*)", "南昌市",
            "上饶市", "上饶市",
            "九江市", "九江市",
            "萍乡市", "萍乡市",
            "新余市", "新余市",
            "鹰潭市", "鹰潭市",
            "赣州市", "赣州市",
            "宜春市", "宜春市",
            "景德镇市", "景德镇市",
            "吉安市", "吉安市",
            "抚州市", "抚州市");
            break;
        case "吉林省" :
            var cityOptions = new Array(
            "长春市(*)", "长春市",
            "吉林市", "吉林市",
            "四平市", "四平市",
            "辽源市", "辽源市",
            "通化市", "通化市",
            "白山市", "白山市",
            "松原市", "松原市",
            "白城市", "白城市",
            "延边朝鲜族自治州", "延边朝鲜族自治州");
            break;
        case "辽宁省" :
            var cityOptions = new Array(
            "沈阳市(*)", "沈阳市",
            "大连市", "大连市",
            "鞍山市", "鞍山市",
            "抚顺市", "抚顺市",
            "本溪市", "本溪市",
            "丹东市", "丹东市",
            "锦州市", "锦州市",
            "营口市", "营口市",
            "阜新市", "阜新市",
            "辽阳市", "辽阳市",
            "盘锦市", "盘锦市",
            "铁岭市", "铁岭市",
            "朝阳市", "朝阳市",
            "葫芦岛市", "葫芦岛市");
            break;
        case "内蒙古自治区" :
            var cityOptions = new Array(
            "呼和浩特市(*)", "呼和浩特市",
            "包头市", "包头市",
            "乌海市", "乌海市",
            "赤峰市", "赤峰市",
            "通辽市", "通辽市",
            "鄂尔多斯市", "鄂尔多斯市",
            "呼伦贝尔市", "呼伦贝尔市",
            "巴彦淖尔市", "巴彦淖尔市",
            "乌兰察布市", "乌兰察布市",
            "兴安盟", "兴安盟",
            "锡林郭勒盟", "锡林郭勒盟",
			"阿拉善盟", "阿拉善盟");
			break;
		 case "宁夏回族自治区" :
            var cityOptions = new Array(
            "银川市(*)", "银川市",
            "石嘴山市", "石嘴山市",
            "吴忠市", "吴忠市",
            "固原市", "固原市",
			"中卫市", "中卫市");
            break;
        case "澳门特别行政区" :
            var cityOptions = new Array(
            "澳门市", "澳门市");
            break;
        case "青海省" :
            var cityOptions = new Array(
            "西宁市(*)", "西宁市",
            "海东地区", "海东地区",
            "海北藏族自治州", "海北藏族自治州",
            "黄南藏族自治州", "黄南藏族自治州",
            "海南藏族自治州", "海南藏族自治州",
            "果洛藏族自治州", "果洛藏族自治州",
            "玉树藏族自治州", "玉树藏族自治州",
            "海西蒙古族藏族自治州", "海西蒙古族藏族自治州");
            break;
        case "山东省" :
            var cityOptions = new Array(
            "济南市(*)", "济南市",
            "青岛市", "青岛市",
            "淄博市", "淄博市",
            "枣庄市", "枣庄市",
            "东营市", "东营市",
            "烟台市", "烟台市",
            "潍坊市", "潍坊市",
            "济宁市", "济宁市",
            "泰安市", "泰安市",
            "威海市", "威海市",
            "日照市", "日照市",
            "滨州市", "滨州市",
            "德州市", "德州市",
            "聊城市", "聊城市",
            "临沂市", "临沂市",
            "菏泽市", "菏泽市",
            "莱芜市", "莱芜市");
            break;
        case "上海市" :
            var cityOptions = new Array(
            "黄浦区", "黄浦区",
            "徐汇区", "徐汇区",
            "长宁区", "长宁区",
            "静安区", "静安区",
            "普陀区", "普陀区",
            "闸北区", "闸北区",
            "虹口区", "虹口区",
            "杨浦区", "杨浦区",
            "闵行区", "闵行区",
            "宝山区", "宝山区",
            "嘉定区", "嘉定区",
            "浦东新区", "浦东新区",
            "金山区", "金山区",
            "松江区", "松江区",
            "青浦区", "青浦区",
            "奉贤区", "奉贤区",
            "崇明县", "崇明县");
            break;
		case "山西省" :
            var cityOptions = new Array(
            "太原市(*)", "太原市",
            "大同市", "大同市",
            "阳泉市", "阳泉市",
            "长治市", "长治市",
            "晋城市", "晋城市",
            "朔州市", "朔州市",
            "晋中市", "晋中市",
            "运城市", "运城市",
            "忻州市", "忻州市",
            "临汾市", "临汾市",
            "吕梁市", "吕梁市");
            break;
        case "陕西省" :
            var cityOptions = new Array(
            "西安市(*)", "西安市",
            "宝鸡市", "宝鸡市",
            "咸阳市", "咸阳市",
            "渭南市", "渭南市",
            "铜川市", "铜川市",
            "延安市", "延安市",
            "榆林市", "榆林市",
            "汉中市", "汉中市",
            "安康市", "安康市",
            "商洛市", "商洛市");
            break;
        case "四川省" :
            var cityOptions = new Array(
            "成都市(*)", "成都市",
            "自贡市", "自贡市",
            "攀枝花市", "攀枝花市",
            "泸州市", "泸州市",
            "德阳市", "德阳市",
			"绵阳市", "绵阳市",
            "广元市", "广元市",
            "遂宁市", "遂宁市",
            "内江市", "内江市",
            "乐山市", "乐山市",
            "南充市", "南充市",
            "宜宾市", "宜宾市",
            "眉山市", "眉山市",
            "广安市", "广安市",
            "达州市", "达州市",
            "雅安市", "雅安市",
            "巴中市", "巴中市",
            "资阳市", "资阳市",
			"阿坝藏族羌族自治州", "阿坝藏族羌族自治州",
            "甘孜藏族自治州", "甘孜藏族自治州",
            "凉山彝族自治州 ", "凉山彝族自治州 ");
            break;
        case "台湾省" :
            var cityOptions = new Array(
            "台北市(*)", "台北市",
            "高雄市", "高雄市",
            "基隆市", "基隆市",
            "新竹市", "新竹市",
            "台南市", "台南市",
            "台中市", "台中市",
            "嘉义市", "嘉义市",
            "台北县", "台北县",
            "台东县", "台东县",
            "澎湖县", "澎湖县",
            "花莲县", "花莲县",
            "屏东县", "屏东县",
            "高雄县", "高雄县",
            "台南县", "台南县",
            "嘉义县", "嘉义县",
            "云林县", "云林县",
            "南投县", "南投县",
            "彰化县", "彰化县",
            "台中县", "台中县",
            "苗栗县", "苗栗县",
            "桃园县", "桃园县",
            "宜兰县", "宜兰县",
            "新竹县", "新竹县",
            "马祖县", "马祖县",
            "金门县", "金门县");
            break;
        case "天津市" :
            var cityOptions = new Array(
            "和平区", "和平区",
            "河西区", "河西区",
            "南开区", "南开区",
            "河东区", "河东区",
            "河北区", "河北区",
            "红桥区", "红桥区",
            "东丽区", "东丽区",
            "津南区", "津南区",
            "西青区", "西青区",
            "北辰区", "北辰区",
            "滨海新区", "滨海新区",
            "武清区", "武清区",
            "宝坻区", "宝坻区",
            "蓟县", "蓟县",
            "宁河县", "宁河县",
            "静海县", "静海县" );
            break;
        case "新疆维吾尔自治区" :
            var cityOptions = new Array(
            "乌鲁木齐市(*)", "乌鲁木齐市",
            "克拉玛依市", "克拉玛依市",
			"吐鲁番地区", "吐鲁番地区",
			"哈密地区", "哈密地区",
			"阿克苏地区", "阿克苏地区",
			"喀什地区", "喀什地区",
			"和田地区", "和田地区",
			"阿勒泰地区", "阿勒泰地区",
            "昌吉回族自治州", "昌吉回族自治州",
            "博尔塔拉蒙古自治州", "博尔塔拉蒙古自治州",
            "巴音郭楞蒙古自治州 ", "巴音郭楞蒙古自治州 ",
            "克孜勒苏柯尔克孜自治州", "克孜勒苏柯尔克孜自治州",
            "伊犁哈萨克自治州", "伊犁哈萨克自治州",
            "石河子市", "石河子市",
			"阿拉尔市", "阿拉尔市",
			"图木舒克市", "图木舒克市",
            "五家渠市", "五家渠市");
            break;
        case "西藏自治区" :
            var cityOptions = new Array(
            "拉萨市(*)", "拉萨市",
            "昌都地区", "昌都地区",
            "林芝地区", "林芝地区",
            "山南地区", "山南地区",
            "日喀则地区", "日喀则地区",
            "那曲地区", "那曲地区",
            "阿里地区", "阿里地区");
            break;
        case "香港特别行政区" :
            var cityOptions = new Array(
            "香港岛", "香港岛",
            "九龙", "九龙",
            "新界", "新界");
            break;
		case "云南省" :
            var cityOptions = new Array(
            "昆明市(*)", "昆明市",
            "曲靖市", "曲靖市",
            "玉溪市", "玉溪市",
            "保山市", "保山市",
            "昭通市", "昭通市",
            "丽江市", "丽江市",
            "普洱市", "普洱市",
            "临沧市", "临沧市",
            "楚雄彝族自治州", "楚雄彝族自治州",
            "大理白族自治州", "大理白族自治州",
            "红河哈尼族彝族自治州", "红河哈尼族彝族自治州",
            "文山壮族苗族自治州", "文山壮族苗族自治州",
            "西双版纳傣族自治州", "西双版纳傣族自治州",
            "德宏傣族景颇族自治州", "德宏傣族景颇族自治州",
            "怒江傈僳族自治州", "怒江傈僳族自治州",
            "迪庆藏族自治州", "迪庆藏族自治州");
            break;
        case "浙江省" :
            var cityOptions = new Array(
            "杭州市(*)", "杭州市",
            "宁波市", "宁波市",
            "温州市", "温州市",
            "嘉兴市", "嘉兴市",
            "湖州市", "湖州市",
            "绍兴市", "绍兴市",
            "金华市", "金华市",
            "衢州市", "衢州市",
            "舟山市", "舟山市",
            "台州市", "台州市",
			"丽水市", "丽水市");
            break;
        case "海外" :
            var cityOptions = new Array(
            "欧洲", "欧洲",
            "北美洲", "北美洲",
            "南美洲", "南美洲",
            "亚洲", "亚洲",
            "非洲", "非洲",
            "大洋洲", "大洋洲");
            break;
        default:
            var cityOptions = new Array("", "");
            break;
    }
	city = document.creator ? document.creator["city"] : document.getElementById('city');
	city.options.length = 0;    
	for(var i = 0; i < cityOptions.length/2; i++) {
	    city.options[i]=new Option(cityOptions[i*2],cityOptions[i*2+1]);
	    if (city.options[i].value==slcity){
	    	city.selectedIndex = i;
	    }
	}
}
function creatprovince(province){
	var provinces = new Array(
		"北京市", "上海市", "重庆市", "安徽省", "福建省", "甘肃省", "广东省", "广西壮族自治区", "贵州省", "海南省", "河北省", "黑龙江省", "河南省",
		"湖北省", "湖南省", "江苏省", "江西省", "吉林省", "辽宁省", "内蒙古自治区", "宁夏回族自治区", "澳门特别行政区", "青海省", "山东省",
		"山西省", "陕西省", "四川省", "台湾省", "天津市", "新疆维吾尔自治区", "西藏自治区","香港特别行政区", "云南省", "浙江省", "海外"
	);
	pro = document.creator ? document.creator["province"] : document.getElementById('province');
	pro.options[0]=new Option("选择省份","");
	for(var i = 0; i < provinces.length; i++) {
	    pro.options[i+1]=new Option(provinces[i],provinces[i]);
		 if (pro.options[i+1].value==province){
	    	pro.selectedIndex = i+1;
	    }
	}
}